// Дано натуральное число n. Выведите все числа от 1 до n.

// let nums=(n)=>{
//     if (n<10) {
//         for (let i = 1; i <= n; i++) {
//             console.log(i)
//         }
//     } else {
//         console.log('??????????')
//     }
// }
// nums(10)

// Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, 
//     если A < B, или в порядке убывания в противном случае.

// let nums = (a, b) => {
//     if ( b<a) {
//         for (let i = b ;i <= a; i++) {
//             console.log(i)
//         }
//     } else {
//         if (a < b) {
//             for (let i = b; i >= a; i--) {
//                 console.log(i)
//             }
//         }
//     }
// }
// nums(12,9)

// функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

//

// Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
//     Двожина масиву від 2 до 100
// EXAMPLE:
//     [1,0,6,0,3] => [1,6,3,0,0]
//     [0,1,2,3,4] => [1,2,3,4,0]
//     [0,0,1,0]   => [1,0,0,0]

// let mas = [1,0,6,0,3,0,6,7]
// let element = (arr)=> {
//     let arr1=[];
//     let arr2=[];
//     let arr3=[];
//     for (let i = 0; i < arr.length; i++) {
//         if  (arr[i]>0){
//             arr1.push(arr[i])
//         } else {
//             if  (arr[i]===0){
//                 arr2.push(arr[i])
//             }
//         }
//     }
//     arr3=arr1.concat(arr2)
//     console.log(arr3)
// }
// element(mas)
