// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив,
//     в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length>=3) {
//     console.log('це великий масив')
// } else if(friends.length>0 && friends.length<3) {
//     console.log('це маленький масив')
// } else {
//     console.log('це не масив')
// }

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// // (friends.length>=3) ? console.log('це великий масив') : console.log('це маленький масив');


//
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let a = +prompt('Введіть число a');
// let b = +prompt('Введіть число b');
// let c = +prompt('Введіть число c');
// if (a > b && a < c || a < b && a > c) {
//     console.log(a, ' - є середнім');
//     console.log('Перше число знаходиться між двома іншими');
// } else if (b > a && b < c || b < a && b > c ) {
//     console.log(b, ' - є середнім');
//     console.log('Перше число не знаходиться між двома іншими');
// } else if (c > a && c < b || c < a && c > b) {
//     console.log(c, ' - є середнім');
//     console.log('Перше число не знаходиться між двома іншими');
// } else if (a===b || a===c || b===c) {
//     console.log ('Серед чисел є однакові')
// } else {
//     console.log( 'це не числа');
// }


// Перепишіть конструкцію if з використанням умовного оператора '?':

// let a = +prompt('Введіть a')
// let b = +prompt('Введіть b')
// let result;
// (a + b < 4) ? result = 'Мало' : result = 'Багато';
// console.log (result)


// Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let xxx = +prompt('Введфть число в межах -100 , 0 , +100 ');
// (xxx>=-100 && xxx<=-1) ? console.log('Це число є негативним'):
//     (xxx>=1 && xxx<=100) ? console.log('Це число є позитивним'):
//         (xxx === 0) ? console.log('Це нуль'): console.log('Ви ввели число, яке  не належить цьому проміжку')